run/depthCharge2D/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

pMin        10000;

water
{
    type pureMovingPhaseModel;
}

air
{
    type multiComponentMovingPhaseModel;
    Sc              0.7;

    residualAlpha   1e-3;
}

sigma
{
    type    constant;
    sigma   0.07;
}

surfaceForces
{
  sigma 0.00;
  surfaceTensionForceModel gradAlpha;
  accelerationForceModel gravity;
  deltaFunctionModel alphaCSF;
}

// ************************************************************************* //
